fabrika/src/Catalogs/ПрофилиГруппДоступа/ПрофилиГруппДоступа.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ПрофилиГруппДоступа</name>
  <hierarchical>true</hierarchical>
  <predefined>
    <items>
      <name>Администратор</name>
      <description>Администратор</description>
    </items>
  </predefined>
  <attributes>
    <name>ИдентификаторПоставляемыхДанных</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <attributes>
    <name>ПоставляемыйПрофильИзменен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Роли</name>
    <attributes>
      <name>Роль</name>
      <type>
        <types>CatalogRef.ИдентификаторыОбъектовМетаданных</types>
      </type>
    </attributes>
    <attributes>
      <name>УдалитьРоль</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ВидыДоступа</name>
    <attributes>
      <name>ВидДоступа</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ВидыДоступа</types>
      </type>
    </attributes>
    <attributes>
      <name>Предустановленный</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ДоступРазрешен</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ЗначенияДоступа</name>
    <attributes>
      <name>ВидДоступа</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ВидыДоступа</types>
      </type>
    </attributes>
    <attributes>
      <name>ЗначениеДоступа</name>
      <type>
        <types>Characteristic.ВидыДоступа</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

fabrika/src/CommonModules/РаботаСВнешнимиИсточникамиДанных/Module.bsl
// Выполняет начальную инициализацию подсистемы прав для работы с внешними источниками данных.
Процедура НачальнаяИнициализация() Экспорт
    
    Профиль = Справочники.ПрофилиГруппДоступа.ПользовательВнешнихИсточниковДанных.ПолучитьОбъект();
    
    Роли = Новый Массив;
    Роли.Добавить("БазовыеПрава");
    Роли.Добавить("ВыводНаПринтерФайлБуферОбмена");
    Роли.Добавить("ДобавлениеИзменениеВариантовОтчетов");
    Роли.Добавить("ДобавлениеИзменениеВзаимодействий");
    Роли.Добавить("ЗапускВебКлиента");
    Роли.Добавить("ЗапускТонкогоКлиента");
    Роли.Добавить("ЗапускТолстогоКлиента");
    Роли.Добавить("ИзменениеТекущегоПользователя");
    Роли.Добавить("ИспользованиеУчетныхЗаписейЭлектроннойПочты");
    Роли.Добавить("ЧтениеБазовойНСИ");
    Роли.Добавить("ЧтениеДополнительныхСведений");
    Роли.Добавить("ПользовательВнешнихИсточниковДанных");
    
    РольДобавлена = Ложь;
    Для Каждого Роль Из Роли Цикл
        Если Профиль.Роли.Найти(Роль) = Неопределено Тогда
            Профиль.Роли.Добавить().Роль = Роль;
            РольДобавлена = Истина;
        КонецЕсли;
    КонецЦикла;
    
    Если РольДобавлена Тогда
        Профиль.Записать();
    КонецЕсли;
    
    ГруппаДоступа = Справочники.ГруппыДоступа.ПользователиВнешнихИсточниковДанных.ПолучитьОбъект();
    Если ГруппаДоступа.Профиль = Справочники.ПрофилиГруппДоступа.ПустаяСсылка() Тогда
        ГруппаДоступа.Профиль = Справочники.ПрофилиГруппДоступа.ПользовательВнешнихИсточниковДанных;
        ГруппаДоступа.Записать();
    КонецЕсли;
    
    ГруппаДоступа = Справочники.ГруппыДоступа.Администраторы.ПолучитьОбъект();
    Если ГруппаДоступа.Профиль = Справочники.ПрофилиГруппДоступа.ПустаяСсылка() Тогда
        ГруппаДоступа.Профиль = Справочники.ПрофилиГруппДоступа.Администратор;
        ГруппаДоступа.Записать();
    КонецЕсли;
    
КонецПроцедуры
